определите, в какой нормальной форме находится данная таблица. Поясните почему вы сделали такой вывод.
приведите таблицу к первой нормальной форме (1НФ). Опишите шаги, которые вы предприняли для устранения нарушений 1НФ.
приведите таблицу ко второй нормальной форме (2НФ). Опишите шаги, которые вы предприняли для устранения нарушений 2НФ.
объясните, в каких случаях может потребоваться денормализация базы данных
предложите один вариант денормализации для вашей нормализованной базы данных, который мог бы повысить производительность запросов или упростить структуру данных. Объясните свой выбор.

Задание со звездочкой* - выполняется по желанию

приведите таблицу к третьей нормальной форме (3НФ). Опишите шаги, которые вы предприняли для устранения нарушений 3НФ.
нарисуйте ER-диаграмму для полученной нормализованной базы данных, обозначив связи между таблицами.
если в вашей нормализованной базе данных присутствуют связи многие-ко-многим, предложите способы их реализации в реляционной базе данных. Опишите, какие дополнительные таблицы или поля для этого нужны. M
